In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
!pwd

/c/Users/Rahul/Desktop/code

In [4]:
!ls /c/Users/Rahul/Downloads/d*

/c/Users/Rahul/Downloads/desktop.ini
/c/Users/Rahul/Downloads/diwali_sales_data.csv

In [5]:
df = pd.read_csv(r"C:\Users\Rahul\Downloads\diwali_sales_data.csv", encoding="latin-1")

In [6]:
df = pd.read_csv("C:\\Users\\Rahul\\Downloads\\diwali_sales_data.csv", encoding="latin-1")

In [7]:
 df.describe()

,User_ID,Age,Marital_Status,Orders,Amount,Status,unnamed1
count,1.125100e+04,11251.000000,11251.000000,11251.000000,11239.000000,0.0,0.0
mean,1.003004e+06,35.421207,0.420318,2.489290,9453.610858,NaN,NaN
std,1.716125e+03,12.754122,0.493632,1.115047,5222.355869,NaN,NaN
min,1.000001e+06,12.000000,0.000000,1.000000,188.000000,NaN,NaN
25%,1.001492e+06,27.000000,0.000000,1.500000,5443.000000,NaN,NaN
50%,1.003065e+06,33.000000,0.000000,2.000000,8109.000000,NaN,NaN
75%,1.004430e+06,43.000000,1.000000,3.000000,12675.000000,NaN,NaN
max,1.006040e+06,92.000000,1.000000,4.000000,23952.000000,NaN,NaN

In [8]:
df.columns

Index(['User_ID', 'Cust_name', 'Product_ID', 'Gender', 'Age Group', 'Age',
       'Marital_Status', 'State', 'Zone', 'Occupation', 'Product_Category',
       'Orders', 'Amount', 'Status', 'unnamed1'],
      dtype='object')

In [9]:
df.shape

(11251, 15)

In [10]:
df["Age Group"].describe()

count     11251
unique        7
top       26-35
freq       4543
Name: Age Group, dtype: object

In [11]:
df["Age Group"].unique()

array(['26-35', '0-17', '18-25', '55+', '46-50', '51-55', '36-45'],
      dtype=object)

In [12]:
df.groupby("Age Group").agg({"Orders":sum})

C:\Users\Rahul\AppData\Local\Temp\ipykernel_15932\3500804841.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.groupby("Age Group").agg({"Orders":sum})

           Orders
Age Group
0-17          690
18-25        4650
26-35       11398
36-45        5697
46-50        2379
51-55        2116
55+          1077

In [13]:
df.shape

(11251, 15)

In [14]:
df.isnull().sum()

User_ID                 0
Cust_name               0
Product_ID              0
Gender                  0
Age Group               0
Age                     0
Marital_Status          0
State                   0
Zone                    0
Occupation              0
Product_Category        0
Orders                  0
Amount                 12
Status              11251
unnamed1            11251
dtype: int64

In [15]:
df.shape

(11251, 15)

In [16]:
df.nunique()

User_ID             3755
Cust_name           1250
Product_ID          2351
Gender                 2
Age Group              7
Age                   81
Marital_Status         2
State                 16
Zone                   5
Occupation            15
Product_Category      18
Orders                 4
Amount              6584
Status                 0
unnamed1               0
dtype: int64

In [17]:
df.groupby("Age Group").agg({"Orders":list})

                                                      Orders
Age Group
0-17       [2, 4, 4, 3, 2, 2, 3, 1, 1, 2, 2, 3, 3, 2, 1, ...
18-25      [4, 2, 2, 2, 4, 4, 2, 1, 4, 1, 2, 2, 1, 2, 2, ...
26-35      [1, 3, 3, 2, 1, 2, 4, 1, 4, 1, 1, 3, 3, 2, 1, ...
36-45      [3, 3, 2, 2, 3, 3, 4, 3, 2, 1, 1, 1, 3, 2, 1, ...
46-50      [3, 3, 2, 1, 2, 3, 2, 1, 4, 1, 1, 3, 1, 4, 4, ...
51-55      [1, 1, 2, 2, 4, 2, 4, 2, 4, 3, 2, 4, 4, 4, 2, ...
55+        [1, 3, 4, 2, 2, 1, 4, 4, 4, 2, 4, 1, 4, 3, 2, ...

In [19]:
df.groupby("Age Group").agg({"Orders":sum}).head()

C:\Users\Rahul\AppData\Local\Temp\ipykernel_15932\3012821550.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.groupby("Age Group").agg({"Orders":sum}).head()

           Orders
Age Group
0-17          690
18-25        4650
26-35       11398
36-45        5697
46-50        2379

In [20]:
print(df)

       User_ID    Cust_name Product_ID Gender Age Group  Age  Marital_Status  \
0      1002903    Sanskriti  P00125942      F     26-35   28               0
1      1000732       Kartik  P00110942      F     26-35   35               1
2      1001990        Bindu  P00118542      F     26-35   35               1
3      1001425       Sudevi  P00237842      M      0-17   16               0
4      1000588         Joni  P00057942      M     26-35   28               1
...        ...          ...        ...    ...       ...  ...             ...
11246  1000695      Manning  P00296942      M     18-25   19               1
11247  1004089  Reichenbach  P00171342      M     26-35   33               0
11248  1001209        Oshin  P00201342      F     36-45   40               0
11249  1004023       Noonan  P00059442      M     36-45   37               0
11250  1002744      Brumley  P00281742      F     18-25   19               0

                State      Zone       Occupation Product_Category  Orders  \
0         Maharashtra   Western       Healthcare             Auto       1
1      AndhraÂ Pradesh  Southern             Govt             Auto       3
2       Uttar Pradesh   Central       Automobile             Auto       3
3           Karnataka  Southern     Construction             Auto       2
4             Gujarat   Western  Food Processing             Auto       2
...               ...       ...              ...              ...     ...
11246     Maharashtra   Western         Chemical           Office       4
11247         Haryana  Northern       Healthcare       Veterinary       3
11248  Madhya Pradesh   Central          Textile           Office       4
11249       Karnataka  Southern      Agriculture           Office       3
11250     Maharashtra   Western       Healthcare           Office       3

        Amount  Status  unnamed1
0      23952.0     NaN       NaN
1      23934.0     NaN       NaN
2      23924.0     NaN       NaN
3      23912.0     NaN       NaN
4      23877.0     NaN       NaN
...        ...     ...       ...
11246    370.0     NaN       NaN
11247    367.0     NaN       NaN
11248    213.0     NaN       NaN
11249    206.0     NaN       NaN
11250    188.0     NaN       NaN

[11251 rows x 15 columns]

In [29]:
s="""ni0'dhi ka,m'al"""

In [30]:
s

"ni0'dhi ka,m'al"

In [31]:
s = "hello geeks"

In [32]:
on= "Hello GG"

In [33]:
s[0]

'h'

In [35]:
v1="H"

In [37]:
v1+s[1:]

'Hello geeks'

In [64]:
 list = [54, 43, 2, 1, 5]

In [65]:
def add_sum(number):
    total=0
    for i in number:
        total=total+i
       
    return total

In [66]:
add_sum(arr)

105

In [84]:
print(arr)

[54, 43, 2, 1, 5]

In [119]:
def multiply(number):
    total=1
    for i in number:
        total=total*i
    return total

In [86]:
multiply(arr)

23220

In [91]:
def plus_1_in_each_number(number):
    for i in range(len(number)):
        number[i]=number[i]+1
    return(number)

In [92]:
plus_1_in_each_number(arr)

[57, 46, 5, 4, 8]

In [93]:
a=[1,2,3,4,5]

In [112]:
def step_up(numbers):
    v=1
    for i in range(len(numbers)):
        numbers[i]=numbers[i]*v
        v=v+2
    return(numbers)

In [118]:
print(len(a))

5

In [117]:
b={a:1, b:2,c:3}
    print(i)

1
3

In [121]:
number=[1,2,3,4]
v=2
for i in number:
    print(v*i)

2
4
6
8

In [123]:
my_string="rahul"
for i in my_string:
    print(i)
len(my_string)

r
a
h
u
l

5

In [124]:
a="hello"
b="world"
a+b

'helloworld'

In [126]:
a+" "+b #string sum opeartion

'hello world'

In [127]:
a+"      "+b

'hello      world'

In [128]:
c="ram"
a+b+c

'helloworldram'

In [149]:
a=("19")  #if we want to add a string which contains numbers soo in that case we have to first convert string into interger by using casting.
b=("10")
num=int(a)+int(b)
num

29

In [153]:
def add_string(e,f):
    return e+f

In [158]:
v=add_string("4","5")

In [159]:
print(v)

None

In [161]:
def add_string(a, b):
    
    return a + b

# Example usage:
result = add_string("Hello ", "World")
print(result)

Hello World

In [170]:
def adding_string(a,b):
    c=a+b
    return(c)

result= adding_string(5,5)
result

10

In [167]:
def equal_sum(a,b):
    if a==b:
        return("equal")
    else:
        return("not equal")
#example
equal_sum(2,3)

'not equal'